/*************************************************************************************************
* timer.c
*
* 版本历史
*
* 版本号      日期      修改者            描述
* 1.00     2005.11.1    王鹏        模块化的第一次版本
*
**************************************************************************************************/

#include "GLOBAL.H"


#define TIMERMAXNUM 10             //定时器的最大个数
/*************************************************
* 名称：ptimeS
* 功能：单稳态延时定时器
* 输入：no,定时器号
        logic,输入信号
        time_delay,输出延时的时间
* 返回：输出信号
         ______
   _____|      |_____  
            _ 
   ________| |________  
**************************************************/
INT8U ptimes(INT8U no,INT8U logic,INT16U time_delay)
{
	static INT16U times[TIMERMAXNUM] = {0}; 
	
	if(no > TIMERMAXNUM) return 0;          //判断定时器号是否越界
			
    if (logic == 0)
    {
        times[no] = time_delay;
        return 0;
    }
    else
    {
        if (times[no] > 0)
        {
            times[no]--;
            if (times[no] == 0)
            {
                return 0xff;
            } 
        }    
    }
    return 0;
}

INT8U ptime(INT8U no,INT16U period)
{
    static INT16U timeu[TIMERMAXNUM] = {0};
	if (timeu[no] > 0)
	{
	    timeu[no]--;
	    return 0;
	}
	else
	{
	    timeu[no] = period;
	    return 0xff;
	}
}

/**************************************************************************************************
END OF FILE
***************************************************************************************************/

